In [45]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split

In [46]:
zoo_data = pd.read_csv('zoo.csv')

In [47]:
zoo_data.shape

(100, 18)

In [98]:
zoo_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 18 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   animal_name  100 non-null    object
 1   hair         100 non-null    int64
 2   feathers     100 non-null    int64
 3   eggs         100 non-null    int64
 4   milk         100 non-null    int64
 5   airborne     100 non-null    int64
 6   aquatic      100 non-null    int64
 7   predator     100 non-null    int64
 8   toothed      100 non-null    int64
 9   backbone     100 non-null    int64
 10  breathes     100 non-null    int64
 11  venomous     100 non-null    int64
 12  fins         100 non-null    int64
 13  legs         100 non-null    int64
 14  tail         100 non-null    int64
 15  domestic     100 non-null    int64
 16  catsize      100 non-null    int64
 17  class_type   100 non-null    int64
dtypes: int64(17), object(1)
memory usage: 14.2+ KB

In [48]:
zoo_data.head()

,animal_name,hair,feathers,eggs,milk,airborne,aquatic,predator,toothed,backbone,breathes,venomous,fins,legs,tail,domestic,catsize,class_type
0,aardvark,1,0,0,1,0,0,1,1,1,1,0,0,4,0,0,1,1
1,antelope,1,0,0,1,0,0,0,1,1,1,0,0,4,1,0,1,1
2,bass,0,0,1,0,0,1,1,1,1,0,0,1,0,1,0,0,4
3,bear,1,0,0,1,0,0,1,1,1,1,0,0,4,0,0,1,1
4,boar,1,0,0,1,0,0,1,1,1,1,0,0,4,1,0,1,1

In [49]:
pd.unique(zoo_data['class_type'].values)

array([1, 4, 2, 7, 6, 5, 3], dtype=int64)

# split dataset into two sets using the iloc method('zoo_x, zoo_y')

In [50]:
zoo_x = zoo_data.iloc[:,1:17]
zoo_y = zoo_data.iloc[:,17:18]

In [51]:
zoo_x.head()

,hair,feathers,eggs,milk,airborne,aquatic,predator,toothed,backbone,breathes,venomous,fins,legs,tail,domestic,catsize
0,1,0,0,1,0,0,1,1,1,1,0,0,4,0,0,1
1,1,0,0,1,0,0,0,1,1,1,0,0,4,1,0,1
2,0,0,1,0,0,1,1,1,1,0,0,1,0,1,0,0
3,1,0,0,1,0,0,1,1,1,1,0,0,4,0,0,1
4,1,0,0,1,0,0,1,1,1,1,0,0,4,1,0,1

In [52]:
zoo_y.head()

   class_type
0           1
1           1
2           4
3           1
4           1

split the features and their corresponding class types in to two sets.                                                     X_train = zoo_x rows*75%, 
X_test = zoo_x rows*25%,
y_train = zoo_y rows*75%,
y_test = zoo_y rows*25%

In [53]:
X_train,X_test,y_train,y_test = train_test_split(zoo_x,zoo_y, test_size=0.25)

In [54]:
X_train.shape

(75, 16)

In [55]:
X_test.shape

(25, 16)

In [56]:
y_train.shape

(75, 1)

In [57]:
y_test.shape

(25, 1)

# build a classifier

In [58]:
zoo_classifier = DecisionTreeClassifier(random_state=0)

# train the classifier using the training data set we have.

In [59]:
zoo_classifier.fit(X_train,y_train)

DecisionTreeClassifier(random_state=0)

# test the accuracy of the classifier

In [60]:
zoo_classifier.score(X_test,y_test)

0.84

# make a prediction based using our model

select some rows in X_test data set and give with that with the parameter...here we have select 0-4 rows of X_test data set ( X_test[0:4] )
and run the method...after that check the given predicted result value with particular y_test data set rows values..

In [61]:
zoo_classifier.predict(X_test[0:4])

array([4, 5, 1, 1], dtype=int64)

In [62]:
y_test.head()

    class_type
85           4
51           5
30           1
66           1
58           2

# Activity 2

In [63]:
column_names = ['buying', 'maint', 'doors', 'persons', 'lug_boot', 'safety', 'car']
data = pd.read_csv('car.csv',header=None, names = column_names)

In [64]:
data.head()

  buying  maint doors persons lug_boot safety    car
0  vhigh  vhigh     2       2    small    low  unacc
1  vhigh  vhigh     2       2    small    med  unacc
2  vhigh  vhigh     2       2    small   high  unacc
3  vhigh  vhigh     2       2      med    low  unacc
4  vhigh  vhigh     2       2      med    med  unacc

In [65]:
data.shape

(1728, 7)

In [66]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1728 entries, 0 to 1727
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   buying    1728 non-null   object
 1   maint     1728 non-null   object
 2   doors     1728 non-null   object
 3   persons   1728 non-null   object
 4   lug_boot  1728 non-null   object
 5   safety    1728 non-null   object
 6   car       1728 non-null   object
dtypes: object(7)
memory usage: 94.6+ KB

In [67]:
Nan_columns = data.columns[data.isnull().any()].tolist()
Nan_columns

[]

In [68]:
for i in data.columns:
    data[i] = data[i].factorize()[0]

In [69]:
data.shape

(1728, 7)

In [70]:
data.head()

   buying  maint  doors  persons  lug_boot  safety  car
0       0      0      0        0         0       0    0
1       0      0      0        0         0       1    0
2       0      0      0        0         0       2    0
3       0      0      0        0         1       0    0
4       0      0      0        0         1       1    0

In [71]:
x = data.iloc[:, 0:6]
y = data.iloc[:, 6:7]

In [96]:
x.head()

   buying  maint  doors  persons  lug_boot  safety
0       0      0      0        0         0       0
1       0      0      0        0         0       1
2       0      0      0        0         0       2
3       0      0      0        0         1       0
4       0      0      0        0         1       1

In [97]:
data.head()

   buying  maint  doors  persons  lug_boot  safety  car
0       0      0      0        0         0       0    0
1       0      0      0        0         0       1    0
2       0      0      0        0         0       2    0
3       0      0      0        0         1       0    0
4       0      0      0        0         1       1    0

In [74]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.20)

In [83]:
cls = DecisionTreeClassifier(random_state = 0)

In [84]:
cls.fit(x_train, y_train)

DecisionTreeClassifier(random_state=0)

In [82]:
cls.score(x_test,y_test)

0.9884393063583815

In [85]:
cls.predict(x_test[0:4])

array([0, 0, 0, 0], dtype=int64)

In [88]:
y_test.head()

     car
992    0
667    0
168    0
877    0
542    0